//  Delete Mathod in Java

// এটি একটি প্রোপার্টি বা একটি ইলিমেন্ট বা অ্যারের একটি ইনডেক্স অনিচ্ছুক করতে ব্যবহার করা যায়। তবে, এটি প্রধানত অবজেক্ট প্রোপার্টিগুলির জন্য ব্যবহার করা হয়।

// একটি উদাহরণ দেখা যাক:

const person = {
  name: 'John',
  age: 30,
  country: 'USA'
};

console.log(person); // Output: { name: 'John', age: 30, country: 'USA' }

// Deleting a property from the object using delete operator
delete person.age;

console.log(person); // Output: { name: 'John', country: 'USA' }


// উপরে, আমরা delete অপারেটর ব্যবহার করে অবজেক্ট person থেকে age প্রোপার্টি অনিচ্ছুক করেছি। তারপরে, আমরা পুনরায় অবজেক্ট লগ করে দেখতে পাচ্ছি যে age প্রোপার্টি অপারেশন করা হয়নি।

// মনে রাখা যাবে যে, অবজেক্ট থেকে কোনো প্রোপার্টি অনিচ্ছুক করার সময় এটি অনিচ্ছুক প্রোপার্টির মানগুলি মুছে ফেলে, কিন্তু স্পেসিফিকেশন অনুযায়ী, অনিচ্ছুক করা অপারেশনটি বাকি অবজেক্টের সহজভাবে প্রভাবিত করবে না।





