//  Valuse of Object or array


// JavaScript ES6 এর Values হলো Object এর প্রোপার্টি গুলির মানগুলি, অর্থাৎ প্রোপার্টি গুলির ভ্যালুগুলি। এই মানগুলি হতে পারে যেকোনো ধরনের ডাটা টাইপ, যেমন: স্ট্রিং, নাম্বার, অবজেক্ট, অ্যারে, ফাংশন, অন্যান্য অব্জেক্ট ইত্যাদি।

// এই Values-গুলি বের করার জন্য আমরা Object.values() মেথডটি ব্যবহার করতে পারি। এটি একটি অবজেক্টের সব মানগুলির একটি অ্যারে প্রদান করে।

// নিচে একটি উদাহরণ দেখা যাক:

const person = {
  name: 'John',
  age: 30,
  country: 'USA'
};

// Object.values() method returns an array of a given object's own enumerable property values
const values = Object.values(person);

console.log(values); // Output: ['John', 30, 'USA']


// উপরে, Object.values() মেথডটি ব্যবহার করে আমরা person অবজেক্টের সব প্রোপার্টি গুলির মানগুলির একটি অ্যারে পেয়েছি। এই অ্যারেতে মানগুলি আছে যেগুলি person অবজেক্টে প্রকাশ্যমান হিসেবে সংরক্ষিত।

// এই মানগুলি ব্যবহার করে আমরা অবজেক্টের প্রোপার্টি গুলির মান বা অ্যাক্সেস করতে পারি। এছাড়াও, আমরা for...of লুপ বা forEach() মেথড ব্যবহার করে এই মানগুলি ব্যাবহার করতে পারি অথবা মানগুলির উপর লোপ চালাতে পারি।